[Killed] StringLiteral
src/components/PokemonData.tsx:11:15
   return (
     <>
       <section>
-        <h2>{ `Summary` }</h2>
+        <h2>{ `` }</h2>
         <p>{ `${summary}` }</p>
       </section>
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> vitest src/tests/PokemonDetails.test.tsx




 RUN  v0.30.1 /home/igor/igor/trybe/projetos/sd-032-a-project-react-testing-library-ts/.stryker-tmp/sandbox8729773

[Killed] StringLiteral
src/components/PokemonData.tsx:12:14
     <>
       <section>
         <h2>{ `Summary` }</h2>
-        <p>{ `${summary}` }</p>
+        <p>{ `` }</p>
       </section>
       <section>
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> vitest src/tests/PokemonDetails.test.tsx




 RUN  v0.30.1 /home/igor/igor/trybe/projetos/sd-032-a-project-react-testing-library-ts/.stryker-tmp/sandbox8729773

[Killed] StringLiteral
src/components/PokemonData.tsx:15:15
         <p>{ `${summary}` }</p>
       </section>
       <section>
-        <h2>{ `Game Locations of ${name}` }</h2>
+        <h2>{ `` }</h2>
         <div className="pokemon-habitat">
           { foundAt.map(({ location, map }) => (
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> vitest src/tests/PokemonDetails.test.tsx




 RUN  v0.30.1 /home/igor/igor/trybe/projetos/sd-032-a-project-react-testing-library-ts/.stryker-tmp/sandbox8729773

[Killed] ArrowFunction
src/components/PokemonData.tsx:17:25
       <section>
         <h2>{ `Game Locations of ${name}` }</h2>
         <div className="pokemon-habitat">
-          { foundAt.map(({ location, map }) => (
-            <div key={ location }>
-              <img
-                src={ `${map}` }
-                alt={ `${name} location` }
-              />
-              <p><em>{ location }</em></p>
-            </div>
-          )) }
+          { foundAt.map(() => undefined) }
         </div>
       </section>
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> vitest src/tests/PokemonDetails.test.tsx




 RUN  v0.30.1 /home/igor/igor/trybe/projetos/sd-032-a-project-react-testing-library-ts/.stryker-tmp/sandbox8729773
